<div class="new">
Name: Mohammad Ali <br>
Github: https://github.com/Muhammad5Ali <br>
Email: "rajaliking789@gmail.com" <br>
Title:"Data Analysis and Data Cleaning" <br>

</div>
<style>
.new{
text-align:center;
color:skyblue;
}
</style>

#Step 1
#Install Libraries

In [1]:
%pip install pandas

Requirement already satisfied: pandas in d:\python\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in d:\python\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\python\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\python\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in d:\python\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in d:\python\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
%pip install numpy  #used for performing the mathematical operations, i,e: when we are dealing matrices, vectors

Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip
ERROR: Invalid requirement: '#used': Expected package name at the start of dependency specifier
    #used
    ^

In [3]:
#Step 2: Import Libraries
import pandas as pd
import numpy as np

In [4]:
#Step 3: Loading the dataset
#Loading the csv data into the dataframe
df=pd.read_csv('data.csv')

In [5]:
df

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [6]:
#Display first few rows of the dataframe
df.head()

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

In [7]:
#Second Way
print(df.head())

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

In [8]:
#Step 4: Check for missing values
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [9]:
mean_value=df['Salary'].mean()
#mean:Average
#median:Center value
#mod: repeated value
df['Salary'].fillna(mean_value,inplace=True)
df['Salary'].isnull().sum()
#inplace true means here that the null values will be replaced by the mean values

C:\Users\PMLS\AppData\Local\Temp\ipykernel_92080\1593187217.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(mean_value,inplace=True)

np.int64(0)

#Step 5: Filling the missing values in 'Salary' column with the mean value

In [10]:
df['Salary'].fillna(df['Salary'].median())

0     1.150000e+05
1     3.500000e+04
2     5.000000e+04
3     7.000000e+04
4     1.500000e+06
5     1.725333e+05
6     2.000000e+04
7     1.150000e+05
8     3.500000e+04
9     1.725333e+05
10    7.000000e+04
11    9.000000e+04
12    1.100000e+05
13    2.000000e+03
14    1.600000e+04
15    1.700000e+05
16    1.900000e+05
Name: Salary, dtype: float64

In [11]:
df['Salary'].fillna(df['Salary'].mean())

0     1.150000e+05
1     3.500000e+04
2     5.000000e+04
3     7.000000e+04
4     1.500000e+06
5     1.725333e+05
6     2.000000e+04
7     1.150000e+05
8     3.500000e+04
9     1.725333e+05
10    7.000000e+04
11    9.000000e+04
12    1.100000e+05
13    2.000000e+03
14    1.600000e+04
15    1.700000e+05
16    1.900000e+05
Name: Salary, dtype: float64

In [12]:
#Now dealing for the Age scenioro
df['Age'].isnull().sum()

np.int64(1)

In [13]:
df['Age'].fillna(df['Age'].median())

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11     30.0
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [14]:
df['Age'].fillna(df['Age'].mean())

0      37.0000
1      30.0000
2      29.0000
3      30.0000
4      25.0000
5      22.0000
6      29.0000
7      26.0000
8      28.0000
9      55.0000
10     60.0000
11     48.6875
12    156.0000
13     67.0000
14     80.0000
15     20.0000
16     85.0000
Name: Age, dtype: float64

In [15]:
median_age=df['Age'].median()
df['Age'].fillna(median_age,inplace=True)

C:\Users\PMLS\AppData\Local\Temp\ipykernel_92080\2561300667.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(median_age,inplace=True)

In [16]:
#Lambda Function apply values 1 to 1 in sequence wise
df['Age'].apply(lambda x:x if x <120 else median_age)

0     37.0
1     30.0
2     29.0
3     30.0
4     25.0
5     22.0
6     29.0
7     26.0
8     28.0
9     55.0
10    60.0
11    30.0
12    30.0
13    67.0
14    80.0
15    20.0
16    85.0
Name: Age, dtype: float64

In [17]:
mean_age=df['Age'].mean()
df['Age'].fillna(mean_age,inplace=True)
df['Age'].isnull().sum()

C:\Users\PMLS\AppData\Local\Temp\ipykernel_92080\3805274690.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(mean_age,inplace=True)

np.int64(0)

In [18]:
df['Age']=df['Age'].apply(lambda x: x if x<120 else mean_age)

In [19]:
df

             Name Designation Gender        Age        Salary
0         Mukhtar   Professor      M  37.000000  1.150000e+05
1           Azziz     Teacher      M  30.000000  3.500000e+04
2          Mohsin    Engineer      M  29.000000  5.000000e+04
3   Naveed Fatima     Analyst      F  30.000000  7.000000e+04
4           Babar    Engineer      F  25.000000  1.500000e+06
5            Aqsa   Scientist      F  22.000000  1.725333e+05
6           Rafia     Analyst      F  29.000000  2.000000e+04
7           Samra   Scientist      F  26.000000  1.150000e+05
8            Eman    Engineer      F  28.000000  3.500000e+04
9        Abdullah     Teacher      M  55.000000  1.725333e+05
10          Mosib   professor      M  60.000000  7.000000e+04
11          Ahmed    engineer      M  30.000000  9.000000e+04
12          Ahsan     trainer      M  47.588235  1.100000e+05
13          Wajid     teacher      M  67.000000  2.000000e+03
14          Naeem     trainer      M  80.000000  1.600000e+04
15         Qaisar   professor      M  20.000000  1.700000e+05
16          Wajid    Engineer      M  85.000000  1.900000e+05

In [20]:
mean_sal=df['Salary'].mean()
df['Salary'].fillna(mean_sal,inplace=True)
df['Salary'].isnull().sum()

C:\Users\PMLS\AppData\Local\Temp\ipykernel_92080\2508297038.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(mean_sal,inplace=True)

np.int64(0)

In [22]:
df['Salary']=df['Salary'].apply(lambda x: x  if x <70000 else mean_sal)
df['Salary']

0     172533.333333
1      35000.000000
2      50000.000000
3     172533.333333
4     172533.333333
5     172533.333333
6      20000.000000
7     172533.333333
8      35000.000000
9     172533.333333
10    172533.333333
11    172533.333333
12    172533.333333
13      2000.000000
14     16000.000000
15    172533.333333
16    172533.333333
Name: Salary, dtype: float64

In [23]:
#Step 8: Standarize the 'Designation' columns to have standard capitalization
df['Designation']=df['Designation'].str.title()
df['Designation']

0     Professor
1       Teacher
2      Engineer
3       Analyst
4      Engineer
5     Scientist
6       Analyst
7     Scientist
8      Engineer
9       Teacher
10    Professor
11     Engineer
12      Trainer
13      Teacher
14      Trainer
15    Professor
16     Engineer
Name: Designation, dtype: object

In [24]:
#step 9: Calculate the average salary by gender
#In groupby first is selected columns and sec is target columns
salary_by_gender=df.groupby('Gender')['Salary'].mean()
salary_by_gender

Gender
F    124188.888889
M    119157.575758
Name: Salary, dtype: float64

In [25]:
salary_by_designation=df.groupby('Designation')['Salary'].mean()
salary_by_designation

Designation
Analyst       96266.666667
Engineer     120520.000000
Professor    172533.333333
Scientist    172533.333333
Teacher       69844.444444
Trainer       94266.666667
Name: Salary, dtype: float64

In [26]:
#Step 10: Calculate the average age by desugnation
age_by_desig=df.groupby('Designation')['Age'].mean()
age_by_desig

Designation
Analyst      29.500000
Engineer     39.400000
Professor    39.000000
Scientist    24.000000
Teacher      50.666667
Trainer      63.794118
Name: Age, dtype: float64

In [27]:
high_sal=df[df['Salary']>100000]
high_sal

             Name Designation Gender        Age         Salary
0         Mukhtar   Professor      M  37.000000  172533.333333
3   Naveed Fatima     Analyst      F  30.000000  172533.333333
4           Babar    Engineer      F  25.000000  172533.333333
5            Aqsa   Scientist      F  22.000000  172533.333333
7           Samra   Scientist      F  26.000000  172533.333333
9        Abdullah     Teacher      M  55.000000  172533.333333
10          Mosib   Professor      M  60.000000  172533.333333
11          Ahmed    Engineer      M  30.000000  172533.333333
12          Ahsan     Trainer      M  47.588235  172533.333333
15         Qaisar   Professor      M  20.000000  172533.333333
16          Wajid    Engineer      M  85.000000  172533.333333

In [28]:
#sorted values
sorting=df.sort_values(by='Age',ascending=True)
sorting

             Name Designation Gender        Age         Salary
15         Qaisar   Professor      M  20.000000  172533.333333
5            Aqsa   Scientist      F  22.000000  172533.333333
4           Babar    Engineer      F  25.000000  172533.333333
7           Samra   Scientist      F  26.000000  172533.333333
8            Eman    Engineer      F  28.000000   35000.000000
2          Mohsin    Engineer      M  29.000000   50000.000000
6           Rafia     Analyst      F  29.000000   20000.000000
1           Azziz     Teacher      M  30.000000   35000.000000
11          Ahmed    Engineer      M  30.000000  172533.333333
3   Naveed Fatima     Analyst      F  30.000000  172533.333333
0         Mukhtar   Professor      M  37.000000  172533.333333
12          Ahsan     Trainer      M  47.588235  172533.333333
9        Abdullah     Teacher      M  55.000000  172533.333333
10          Mosib   Professor      M  60.000000  172533.333333
13          Wajid     Teacher      M  67.000000    2000.000000
14          Naeem     Trainer      M  80.000000   16000.000000
16          Wajid    Engineer      M  85.000000  172533.333333

In [29]:
#Step 13: Saved the cleaned dataframe to a new csv file
df.to_csv('cleaned_data.csv',index=False)